fix patterns and improve docs
